package com.study._27_Interface;

public class Main {
    public static void main(String[] args) {

        /*
        인터페이스 : 자바에서 구현할 수 있는 최상위 추상 레벨
        1. 필드가 없음(상수는 가능)
        => 상태가 존재하지 않음
        2. 메서드 시그니처(함수명, 반환타입, 매개변수)만 정의(모든 메서드가 추상메서드)
        => "어떤 기능을 가진다"라는 명세만 정의
        3. 메서드 영역에만 정보가 존재
        4. 생성자 없음
        => 다중상속시 발생하는문제(어떤 부모의 필드/생성자)를 가져와야하나?가 없음
        => 다중상속이 가능
        5. 객체 생성 불가능

        클래스 : 구현체
        추상클래스 : 구현체 ~ 추상체(중간지대)
        인터페이스 : 추상체

        그럼에도 추상클래스가 계속해서 쓰이는 이유
        => 공통 상태(필드), 기본적인 구현이 공유되는 상황
         */
    }
}
